/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，其功能是将形参s所指字符串放入形参a所指的字符数组中，使a
      中存放同样的字符串。说明：不得使用系统提供的字符串函数。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun指定的部位填入
      你所编写的若干语句。

-------------------------------------------------------*/

#include  <stdio.h>

#define    N    20

void  fun( char  *a , char  *s)
{
/**********Program**********/
	while (*s!='\0') {
		*a = *s;
		a++;        
		s++;
	}
	*a = '\0';
/**********  End  **********/
}

int main()
{  
        char  s1[N];
         char  s2[20]="abcdefghijk";
        fun( s1,s2);
        printf("%s\n", s1);
      //   s2[3]='\0';
        printf("%s\n", s2);
        while(1);
}

