/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：从键盘上输入一个字符串，放在数组中，要求将字符串中
      的大写字母转换成小写字母，小写字母转换成大写字母，
      非字母字符不变，并输出

-------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include <conio.h>
#define N 80

// char fun(char a[])
// {

//     /**********Program**********/
// 	int i = 0;
// 	while (a[i]!='\0')
// 	{
// 		if ('A'<=a[i] && a[i]<='Z') a[i]+=32;
// 		else if ('a'<=a[i] && a[i]<='z') a[i]-=32;
// 		i++;
// 	}     
// 	return a[N];
//     /**********  End  **********/
// }

// int main()
// {
//     char a[80];
//     char s;
//     gets(a);
//     s=fun(a);
//     puts(a);
//     return 0;
// }

/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：从键盘上输入一个字符，放在一个变量中，要求将字符中
      的大写字母转换成小写字母，小写字母转换成大写字母，
      非字母字符不变，并使用 printf 输出转化后的字符

-------------------------------------------------------*/
int main()
{
    char s;
    
    scanf("%c",&s);
/*你的代码与处理过程*/

/*-----------------------------*/
    printf("%c",s);
    return 0;
}