/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写一个函数copystr(p,q)，将p所指向的字符串的所有在奇数位置上的字符

复制到q所指向的字符串中。如：原字符串为“abcd”，得到的字符串为“ac”

要求：p,q为指针参数，在主函数中实现字符串的输入与输出。

-------------------------------------------------------*/
#include <stdio.h>
int copystr(char *p, char *q)
{
	int i, j = 0;

	/**********Program**********/
	for (i = 0; p[i] != '\0'; i++)
		if (i % 2 == 0)
		{
			q[j++] = p[i];
		}

	q[j] = '\0';
	/**********  End  **********/
}
int main()
{
	char str1[20], str2[20];
	printf("请输入1个字符:");
	gets(str1);
	copystr(str1, str2);
	printf("奇数位置上的字符为:");
	puts(str2);
	while (1)
		;
}

/*	i = 0;
	while (p[i]!='\0') i++;
	i = (i+1)/2;
	for (j = 0; j < i; j++) {
		*q = *p;
		q++;
		p += 2;
	}
	*q = '\0';
*/
