/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：函数fun的功能是：将两个两位数的正整数 a、b合并成一个整数放在c中。
      合并的方式是：将a数的十位和个位数依次放在c数的千位和十位上,b数的
      十位和个位数依次放在c数的百位和个位上。

例如：当a=45,b=12时,调用该函数后c=4152。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/

#include <stdio.h>

void fun(int a, int b, long *c)
{
/**********Program**********/
	int x, y, m, n;
	x=a/10; y=b/10; m=a%10; n=b%10;
	*c=x*1000 + y*100 + m*10 + n;
/**********  End  **********/
}
int main()
{  
        int a,b; long c;
        printf("Input a, b:");  
        scanf("%d %d", &a, &b);
        fun(a, b, &c);
        printf("The result is: %d\n", c);
}

