/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写一个对n个数进行排序（由小到大）的函数，要求使用指针作为函数参数，
      在主函数中输入n个数，调用函数对n个数进行排序，并输出结果。

-------------------------------------------------------*/
#include <stdio.h>
int main()
{
        int i,a[10]={2,5,6,1,12,4,8,9,41,10};
        void sort(int *p,int n);
        sort(a,10);
        for(i=0;i<10;i++)
                printf("%d ",a[i]);
        printf("\n");
}

void sort(int *p,int n)
{
        int i,j,t;

       /**********Program**********/
		for (i = 0 ; i < n-1; i++) {
			for (j = 0 ; j < n-1-i; j++) {
				if (p[j]>p[j+1]) {
					t = p[j];
					p[j]= p[j+1];
					p[j+1] = t;
				}
			}
		}
       /**********  End  **********/
}

