/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写函数fun对主程序中用户输入的具有10
      个数据的数组a按由大到小排序，并在主程序中输出
      排序结果。

===> 输入:
1 2 3 4 5 6 7 8 9 11
排序结果是:
  11   9   8   7   6   5   4   3   2   1

------------------------------------------------*/

#include <stdio.h>

void fun(int array[], int n)
{
  /**********Program**********/
	int i , j, MIN = 0;
	for (i = 0; i < n-1; i++) {
		for (j = 0; j < n-1-i; j++) {
			if (array[j] < array[j+1]) {
				int temp = array[j];
				array[j] = array[j+1];
				array[j+1] = temp;
			}
		}
	}  
  /**********  End  **********/
}

main()
{
  int a[10],i;
  printf("请输入数组a中的十个数:\n");
  for (i=0;i<10;i++)
    scanf("%d",&a[i]);
  fun(a,10);
  printf("由大到小的排序结果是:\n");
  for (i=0;i<10;i++)
    printf("%4d",a[i]);
  printf("\n");  
  
}



