/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：实现B＝A＋A'，即将矩阵A加上A的转置，存放在矩阵B中。
      计算结果在main函数中输出。

例如：输入下面的矩阵：其转置矩阵为：“样张1”。程序输出：“样张2”。
             
注意：请勿请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/

#include <stdio.h>

void  fun ( int a[3][3], int b[3][3])
{
/**********Program**********/
	int i, j;
	for (i = 0; i < 3; i++) {
		for (j = i; j < 3; j++) {
			b[i][j] = b[j][i] = a[i][j]+a[j][i];
		}
	}
/**********  End  **********/
}

int main( )   /* 主程序 */
{  
        int a[3][3] = {{1, 2, 3}, {4, 5, 6}, {7, 8, 9}}, t[3][3] ;
        int i, j ;
   
        fun(a, t) ;
        for (i = 0 ; i < 3 ; i++) 
        {
                for (j = 0 ; j < 3 ; j++)
                        printf("%7d", t[i][j]) ;
                printf("\n") ;
        }
        while(1);
}

