/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun,函数的功能是：移动一维数组中的内容,若数组中有n个整数,要求
      把下标从0~p（含p,p小于 等于n-1）的数组元素平移到数组的最后。

例如：一维数组中的原始内容：1,2,3,4,5,6,7,8,9,10;p的值为3。移动后,一维数组中的
      内容应为： 5,6,7,8,9,10,1,2,3,4。

注意：请勿改动main函数和其他函数中的任何内容，仅在函数fun的花括号
      中填入所编写的若干语句。

-------------------------------------------------------*/

#include <stdio.h>

#define    N    80

void fun(int *w, int p, int n)
{
/**********Program**********/
	int a[15],j=0,i;
	for (i = 0; i <= p; i++)
		a[i]=w[i];
	for (i = 0; i < n-p-1; i++)
		w[i]=w[i+p+1];
	for (i =n-p-1 ; i < n; i++){
		w[i]=a[j];
		j++;
	}
/**********  End  **********/
}

int main()
{  
        int  a[N]={1,2,3,4,5,6,7,8,9,10,11,12,13,14,15};
        int  i,p,n=15;
        printf("The original data:\n");
        for(i=0; i<n; i++)
                printf("%3d",a[i]);
        printf("\n\nEnter  p:  ");
        scanf("%d",&p);
        fun(a,p,n);
        printf("\nThe data after moving:\n");
        for(i=0; i<n; i++)printf("%3d",a[i]);
        printf("\n\n");
}

