/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：规定输入的字符串中只包含字母和*号。请编写函数fun，其功能是：使字符串的
      前导*号不得多于n个，若多于n个，则删除多余的*号；若少于或等n个，则不做处
      理，字符串中间和尾部的*号不删除。

例如：字符串中的内容为：*******A*BC*DEF*G****，若n的值为4，删除后，字符串中的
      内容应当是：****A*BC*DEF*G****；若n的值为8，则字符串中的内容仍
      为：*******A*BC*DEF*G****。n的值在主函数中输入。在编写函数时，
      不得使用C语言提供的字符串函数。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h> 

void  fun( char *a, int  n )
{
/**********Program**********/
int i = 0, j = 0, k = 0;
while (a[i]=='*') i++;
while (a[j]!='\0') j++;
if (i>n) {
	for (k = 0; k <= j-i+n; k++)
		a[k] = a[k+i-n];
}
/**********  End  **********/
}

void main()
{  
        char  s[81];  int  n;
        printf("Enter a string:\n");
        gets(s);
        printf("Enter n :  ");
        scanf("%d",&n);
        fun( s,n );
        printf("The string after deleted:\n");
        puts(s);
}
